TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_nvic.h
//###########################################################################
//
// FILE:    hw_nvic.h
//
// TITLE:   Definitions for the NVIC registers.
//
//###########################################################################
// 
// C2000Ware v26.00.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_NVIC_H
#define HW_NVIC_H

//*************************************************************************************************
//
// The following are defines for the NVIC register offsets
//
//*************************************************************************************************
#define NVIC_O_ISER0   0x100U   // NVIC Interrupt Set Enable Register 0
#define NVIC_O_ISER1   0x104U   // NVIC Interrupt Set Enable Register 1
#define NVIC_O_ICER0   0x180U   // NVIC Interrupt Clear Enable Register 0
#define NVIC_O_ICER1   0x184U   // NVIC Interrupt Clear Enable Register 1
#define NVIC_O_ISPR0   0x200U   // NVIC Interrupt Set Pending Register 0
#define NVIC_O_ISPR1   0x204U   // NVIC Interrupt Set Pending Register 1
#define NVIC_O_ISPR2   0x208U   // NVIC Interrupt Set Pending Register 2
#define NVIC_O_ICPR0   0x280U   // NVIC Interrupt Clear Pending Register 0
#define NVIC_O_ICPR1   0x284U   // NVIC Interrupt Clear Pending Register 1
#define NVIC_O_IABR0   0x300U   // NVIC Interrupt Active Bit Register 0
#define NVIC_O_IABR1   0x304U   // NVIC Interrupt Active Bit Register 1
#define NVIC_O_IPR0    0x400U   // NVIC Interrupt Priority Register 0
#define NVIC_O_IPR1    0x404U   // NVIC Interrupt Priority Register 1
#define NVIC_O_IPR2    0x408U   // NVIC Interrupt Priority Register 2
#define NVIC_O_IPR3    0x40CU   // NVIC Interrupt Priority Register 3
#define NVIC_O_IPR4    0x410U   // NVIC Interrupt Priority Register 4
#define NVIC_O_IPR5    0x414U   // NVIC Interrupt Priority Register 5
#define NVIC_O_IPR6    0x418U   // NVIC Interrupt Priority Register 6
#define NVIC_O_IPR7    0x41CU   // NVIC Interrupt Priority Register 7
#define NVIC_O_IPR8    0x420U   // NVIC Interrupt Priority Register 8
#define NVIC_O_IPR9    0x424U   // NVIC Interrupt Priority Register 9
#define NVIC_O_IPR10   0x428U   // NVIC Interrupt Priority Register 10
#define NVIC_O_IPR11   0x42CU   // NVIC Interrupt Priority Register 11
#define NVIC_O_IPR12   0x430U   // NVIC Interrupt Priority Register 12
#define NVIC_O_IPR13   0x434U   // NVIC Interrupt Priority Register 13
#define NVIC_O_IPR14   0x438U   // NVIC Interrupt Priority Register 14
#define NVIC_O_IPR15   0x43CU   // NVIC Interrupt Priority Register 15
#define NVIC_O_STIR    0xF00U   // Software Trigger Interrupt Register

#define NVIC_O_ACTLR    0x8U     // Auxiliary Control Register
#define NVIC_O_CPUID    0xD00U   // CPUID Base Register
#define NVIC_O_ICSR     0xD04U   // Interrupt Control and State Register
#define NVIC_O_VTOR     0xD08U   // Vector Table Offset Register
#define NVIC_O_AIRCR    0xD0CU   // Application Interrupt and Reset Control Register
#define NVIC_O_SCR      0xD10U   // System Control Register
#define NVIC_O_CCR      0xD14U   // Configuration and Control Register
#define NVIC_O_SHPR1    0xD18U   // System Handler Priority Register 1
#define NVIC_O_SHPR2    0xD1CU   // System Handler Priority Register 2
#define NVIC_O_SHPR3    0xD20U   // System Handler Priority Register 3
#define NVIC_O_SHCSRS   0xD24U   // System Handler Control and State Register
#define NVIC_O_CFSR     0xD28U   // Configurable Fault Status Register
#define NVIC_O_HFSR     0xD2CU   // HardFault Status Register
#define NVIC_O_MMFAR    0xD34U   // MemManage Fault Address Register
#define NVIC_O_BFAR     0xD38U   // BusFault Address Register
#define NVIC_O_AFSR     0xD3CU   // Auxiliary Fault Status Register

#define NVIC_O_MMSR   0xD28U   // MemManage Fault Status Register
#define NVIC_O_BFSR   0xD29U   // BusFault Status Register
#define NVIC_O_UFSR   0xD2AU   // UsageFault Status Register

#define NVIC_O_SYST_CSR     0x10U   // Privileged a SysTick Control and Status Register
#define NVIC_O_SYST_RVR     0x14U   // Privileged Unknown SysTick Reload Value Register
#define NVIC_O_SYST_CVR     0x18U   // Privileged Unknown SysTick Current Value Register
#define NVIC_O_SYST_CALIB   0x1CU   // Privileged -a SysTick Calibration Value Register

#define NVIC_O_MPU_TYPE      0xD90U   // MPU Type Register
#define NVIC_O_MPU_CTRL      0xD94U   // MPU Control Register
#define NVIC_O_MPU_RNR       0xD98U   // MPU Region Number Register
#define NVIC_O_MPU_RBAR      0xD9CU   // MPU Region Base Address Register
#define NVIC_O_MPU_RASR      0xDA0U   // MPU Region Attribute and Size Register
#define NVIC_O_MPU_RBAR_A1   0xDA4U   // Alias of RBAR
#define NVIC_O_MPU_RASR_A1   0xDA8U   // Alias of RASR
#define NVIC_O_MPU_RBAR_A2   0xDACU   // Alias of RBAR
#define NVIC_O_MPU_RASR_A2   0xDB0U   // Alias of RASR
#define NVIC_O_MPU_RBAR_A3   0xDB4U   // Alias of RBAR
#define NVIC_O_MPU_RASR_A3   0xDB8U   // Alias of RASR


//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_ISER0 register
//
//*************************************************************************************************
#define NVIC_ISER0_SETENA0    0x1U          // Set INTR0 Enable
#define NVIC_ISER0_SETENA1    0x2U          // Set INTR1 Enable
#define NVIC_ISER0_SETENA2    0x4U          // Set INTR2 Enable
#define NVIC_ISER0_SETENA3    0x8U          // Set INTR3 Enable
#define NVIC_ISER0_SETENA4    0x10U         // Set INTR4 Enable
#define NVIC_ISER0_SETENA5    0x20U         // Set INTR5 Enable
#define NVIC_ISER0_SETENA6    0x40U         // Set INTR6 Enable
#define NVIC_ISER0_SETENA7    0x80U         // Set INTR7 Enable
#define NVIC_ISER0_SETENA8    0x100U        // Set INTR8 Enable
#define NVIC_ISER0_SETENA9    0x200U        // Set INTR9 Enable
#define NVIC_ISER0_SETENA10   0x400U        // Set INTR10 Enable
#define NVIC_ISER0_SETENA11   0x800U        // Set INTR11 Enable
#define NVIC_ISER0_SETENA12   0x1000U       // Set INTR12 Enable
#define NVIC_ISER0_SETENA13   0x2000U       // Set INTR13 Enable
#define NVIC_ISER0_SETENA14   0x4000U       // Set INTR14 Enable
#define NVIC_ISER0_SETENA15   0x8000U       // Set INTR15 Enable
#define NVIC_ISER0_SETENA16   0x10000U      // Set INTR16 Enable
#define NVIC_ISER0_SETENA17   0x20000U      // Set INTR17 Enable
#define NVIC_ISER0_SETENA18   0x40000U      // Set INTR18 Enable
#define NVIC_ISER0_SETENA19   0x80000U      // Set INTR19 Enable
#define NVIC_ISER0_SETENA20   0x100000U     // Set INTR20 Enable
#define NVIC_ISER0_SETENA21   0x200000U     // Set INTR21 Enable
#define NVIC_ISER0_SETENA22   0x400000U     // Set INTR22 Enable
#define NVIC_ISER0_SETENA23   0x800000U     // Set INTR23 Enable
#define NVIC_ISER0_SETENA24   0x1000000U    // Set INTR24 Enable
#define NVIC_ISER0_SETENA25   0x2000000U    // Set INTR25 Enable
#define NVIC_ISER0_SETENA26   0x4000000U    // Set INTR26 Enable
#define NVIC_ISER0_SETENA27   0x8000000U    // Set INTR27 Enable
#define NVIC_ISER0_SETENA28   0x10000000U   // Set INTR28 Enable
#define NVIC_ISER0_SETENA29   0x20000000U   // Set INTR29 Enable
#define NVIC_ISER0_SETENA30   0x40000000U   // Set INTR30 Enable
#define NVIC_ISER0_SETENA31   0x80000000U   // Set INTR31 Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_ISER1 register
//
//*************************************************************************************************
#define NVIC_ISER1_SETENA32   0x1U          // Set INTR32 Enable
#define NVIC_ISER1_SETENA33   0x2U          // Set INTR33 Enable
#define NVIC_ISER1_SETENA34   0x4U          // Set INTR34 Enable
#define NVIC_ISER1_SETENA35   0x8U          // Set INTR35 Enable
#define NVIC_ISER1_SETENA36   0x10U         // Set INTR36 Enable
#define NVIC_ISER1_SETENA37   0x20U         // Set INTR37 Enable
#define NVIC_ISER1_SETENA38   0x40U         // Set INTR38 Enable
#define NVIC_ISER1_SETENA39   0x80U         // Set INTR39 Enable
#define NVIC_ISER1_SETENA40   0x100U        // Set INTR40 Enable
#define NVIC_ISER1_SETENA41   0x200U        // Set INTR41 Enable
#define NVIC_ISER1_SETENA42   0x400U        // Set INTR42 Enable
#define NVIC_ISER1_SETENA43   0x800U        // Set INTR43 Enable
#define NVIC_ISER1_SETENA44   0x1000U       // Set INTR44 Enable
#define NVIC_ISER1_SETENA45   0x2000U       // Set INTR45 Enable
#define NVIC_ISER1_SETENA46   0x4000U       // Set INTR46 Enable
#define NVIC_ISER1_SETENA47   0x8000U       // Set INTR47 Enable
#define NVIC_ISER1_SETENA48   0x10000U      // Set INTR48 Enable
#define NVIC_ISER1_SETENA49   0x20000U      // Set INTR49 Enable
#define NVIC_ISER1_SETENA50   0x40000U      // Set INTR50 Enable
#define NVIC_ISER1_SETENA51   0x80000U      // Set INTR51 Enable
#define NVIC_ISER1_SETENA52   0x100000U     // Set INTR52 Enable
#define NVIC_ISER1_SETENA53   0x200000U     // Set INTR53 Enable
#define NVIC_ISER1_SETENA54   0x400000U     // Set INTR54 Enable
#define NVIC_ISER1_SETENA55   0x800000U     // Set INTR55 Enable
#define NVIC_ISER1_SETENA56   0x1000000U    // Set INTR56 Enable
#define NVIC_ISER1_SETENA57   0x2000000U    // Set INTR57 Enable
#define NVIC_ISER1_SETENA58   0x4000000U    // Set INTR58 Enable
#define NVIC_ISER1_SETENA59   0x8000000U    // Set INTR59 Enable
#define NVIC_ISER1_SETENA60   0x10000000U   // Set INTR60 Enable
#define NVIC_ISER1_SETENA61   0x20000000U   // Set INTR61 Enable
#define NVIC_ISER1_SETENA62   0x40000000U   // Set INTR62 Enable
#define NVIC_ISER1_SETENA63   0x80000000U   // Set INTR63 Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_ICER0 register
//
//*************************************************************************************************
#define NVIC_ICER0_CLRENA0    0x1U          // Clear INTR0 Enable
#define NVIC_ICER0_CLRENA1    0x2U          // Clear INTR1 Enable
#define NVIC_ICER0_CLRENA2    0x4U          // Clear INTR2 Enable
#define NVIC_ICER0_CLRENA3    0x8U          // Clear INTR3 Enable
#define NVIC_ICER0_CLRENA4    0x10U         // Clear INTR4 Enable
#define NVIC_ICER0_CLRENA5    0x20U         // Clear INTR5 Enable
#define NVIC_ICER0_CLRENA6    0x40U         // Clear INTR6 Enable
#define NVIC_ICER0_CLRENA7    0x80U         // Clear INTR7 Enable
#define NVIC_ICER0_CLRENA8    0x100U        // Clear INTR8 Enable
#define NVIC_ICER0_CLRENA9    0x200U        // Clear INTR9 Enable
#define NVIC_ICER0_CLRENA10   0x400U        // Clear INTR10 Enable
#define NVIC_ICER0_CLRENA11   0x800U        // Clear INTR11 Enable
#define NVIC_ICER0_CLRENA12   0x1000U       // Clear INTR12 Enable
#define NVIC_ICER0_CLRENA13   0x2000U       // Clear INTR13 Enable
#define NVIC_ICER0_CLRENA14   0x4000U       // Clear INTR14 Enable
#define NVIC_ICER0_CLRENA15   0x8000U       // Clear INTR15 Enable
#define NVIC_ICER0_CLRENA16   0x10000U      // Clear INTR16 Enable
#define NVIC_ICER0_CLRENA17   0x20000U      // Clear INTR17 Enable
#define NVIC_ICER0_CLRENA18   0x40000U      // Clear INTR18 Enable
#define NVIC_ICER0_CLRENA19   0x80000U      // Clear INTR19 Enable
#define NVIC_ICER0_CLRENA20   0x100000U     // Clear INTR20 Enable
#define NVIC_ICER0_CLRENA21   0x200000U     // Clear INTR21 Enable
#define NVIC_ICER0_CLRENA22   0x400000U     // Clear INTR22 Enable
#define NVIC_ICER0_CLRENA23   0x800000U     // Clear INTR23 Enable
#define NVIC_ICER0_CLRENA24   0x1000000U    // Clear INTR24 Enable
#define NVIC_ICER0_CLRENA25   0x2000000U    // Clear INTR25 Enable
#define NVIC_ICER0_CLRENA26   0x4000000U    // Clear INTR26 Enable
#define NVIC_ICER0_CLRENA27   0x8000000U    // Clear INTR27 Enable
#define NVIC_ICER0_CLRENA28   0x10000000U   // Clear INTR28 Enable
#define NVIC_ICER0_CLRENA29   0x20000000U   // Clear INTR29 Enable
#define NVIC_ICER0_CLRENA30   0x40000000U   // Clear INTR30 Enable
#define NVIC_ICER0_CLRENA31   0x80000000U   // Clear INTR31 Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_ICER1 register
//
//*************************************************************************************************
#define NVIC_ICER1_CLRENA32   0x1U          // Clear INTR32 Enable
#define NVIC_ICER1_CLRENA33   0x2U          // Clear INTR33 Enable
#define NVIC_ICER1_CLRENA34   0x4U          // Clear INTR34 Enable
#define NVIC_ICER1_CLRENA35   0x8U          // Clear INTR35 Enable
#define NVIC_ICER1_CLRENA36   0x10U         // Clear INTR36 Enable
#define NVIC_ICER1_CLRENA37   0x20U         // Clear INTR37 Enable
#define NVIC_ICER1_CLRENA38   0x40U         // Clear INTR38 Enable
#define NVIC_ICER1_CLRENA39   0x80U         // Clear INTR39 Enable
#define NVIC_ICER1_CLRENA40   0x100U        // Clear INTR40 Enable
#define NVIC_ICER1_CLRENA41   0x200U        // Clear INTR41 Enable
#define NVIC_ICER1_CLRENA42   0x400U        // Clear INTR42 Enable
#define NVIC_ICER1_CLRENA43   0x800U        // Clear INTR43 Enable
#define NVIC_ICER1_CLRENA44   0x1000U       // Clear INTR44 Enable
#define NVIC_ICER1_CLRENA45   0x2000U       // Clear INTR45 Enable
#define NVIC_ICER1_CLRENA46   0x4000U       // Clear INTR46 Enable
#define NVIC_ICER1_CLRENA47   0x8000U       // Clear INTR47 Enable
#define NVIC_ICER1_CLRENA48   0x10000U      // Clear INTR48 Enable
#define NVIC_ICER1_CLRENA49   0x20000U      // Clear INTR49 Enable
#define NVIC_ICER1_CLRENA50   0x40000U      // Clear INTR50 Enable
#define NVIC_ICER1_CLRENA51   0x80000U      // Clear INTR51 Enable
#define NVIC_ICER1_CLRENA52   0x100000U     // Clear INTR52 Enable
#define NVIC_ICER1_CLRENA53   0x200000U     // Clear INTR53 Enable
#define NVIC_ICER1_CLRENA54   0x400000U     // Clear INTR54 Enable
#define NVIC_ICER1_CLRENA55   0x800000U     // Clear INTR55 Enable
#define NVIC_ICER1_CLRENA56   0x1000000U    // Clear INTR56 Enable
#define NVIC_ICER1_CLRENA57   0x2000000U    // Clear INTR57 Enable
#define NVIC_ICER1_CLRENA58   0x4000000U    // Clear INTR58 Enable
#define NVIC_ICER1_CLRENA59   0x8000000U    // Clear INTR59 Enable
#define NVIC_ICER1_CLRENA60   0x10000000U   // Clear INTR60 Enable
#define NVIC_ICER1_CLRENA61   0x20000000U   // Clear INTR61 Enable
#define NVIC_ICER1_CLRENA62   0x40000000U   // Clear INTR62 Enable
#define NVIC_ICER1_CLRENA63   0x80000000U   // Clear INTR63 Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_ISPR0 register
//
//*************************************************************************************************
#define NVIC_ISPR0_SETPEND0    0x1U          // Set INTR0 Pending
#define NVIC_ISPR0_SETPEND1    0x2U          // Set INTR1 Pending
#define NVIC_ISPR0_SETPEND2    0x4U          // Set INTR2 Pending
#define NVIC_ISPR0_SETPEND3    0x8U          // Set INTR3 Pending
#define NVIC_ISPR0_SETPEND4    0x10U         // Set INTR4 Pending
#define NVIC_ISPR0_SETPEND5    0x20U         // Set INTR5 Pending
#define NVIC_ISPR0_SETPEND6    0x40U         // Set INTR6 Pending
#define NVIC_ISPR0_SETPEND7    0x80U         // Set INTR7 Pending
#define NVIC_ISPR0_SETPEND8    0x100U        // Set INTR8 Pending
#define NVIC_ISPR0_SETPEND9    0x200U        // Set INTR9 Pending
#define NVIC_ISPR0_SETPEND10   0x400U        // Set INTR10 Pending
#define NVIC_ISPR0_SETPEND11   0x800U        // Set INTR11 Pending
#define NVIC_ISPR0_SETPEND12   0x1000U       // Set INTR12 Pending
#define NVIC_ISPR0_SETPEND13   0x2000U       // Set INTR13 Pending
#define NVIC_ISPR0_SETPEND14   0x4000U       // Set INTR14 Pending
#define NVIC_ISPR0_SETPEND15   0x8000U       // Set INTR15 Pending
#define NVIC_ISPR0_SETPEND16   0x10000U      // Set INTR16 Pending
#define NVIC_ISPR0_SETPEND17   0x20000U      // Set INTR17 Pending
#define NVIC_ISPR0_SETPEND18   0x40000U      // Set INTR18 Pending
#define NVIC_ISPR0_SETPEND19   0x80000U      // Set INTR19 Pending
#define NVIC_ISPR0_SETPEND20   0x100000U     // Set INTR20 Pending
#define NVIC_ISPR0_SETPEND21   0x200000U     // Set INTR21 Pending
#define NVIC_ISPR0_SETPEND22   0x400000U     // Set INTR22 Pending
#define NVIC_ISPR0_SETPEND23   0x800000U     // Set INTR23 Pending
#define NVIC_ISPR0_SETPEND24   0x1000000U    // Set INTR24 Pending
#define NVIC_ISPR0_SETPEND25   0x2000000U    // Set INTR25 Pending
#define NVIC_ISPR0_SETPEND26   0x4000000U    // Set INTR26 Pending
#define NVIC_ISPR0_SETPEND27   0x8000000U    // Set INTR27 Pending
#define NVIC_ISPR0_SETPEND28   0x10000000U   // Set INTR28 Pending
#define NVIC_ISPR0_SETPEND29   0x20000000U   // Set INTR29 Pending
#define NVIC_ISPR0_SETPEND30   0x40000000U   // Set INTR30 Pending
#define NVIC_ISPR0_SETPEND31   0x80000000U   // Set INTR31 Pending

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_ISPR1 register
//
//*************************************************************************************************
#define NVIC_ISPR1_SETPEND32   0x1U          // Set INTR32 Pending
#define NVIC_ISPR1_SETPEND33   0x2U          // Set INTR33 Pending
#define NVIC_ISPR1_SETPEND34   0x4U          // Set INTR34 Pending
#define NVIC_ISPR1_SETPEND35   0x8U          // Set INTR35 Pending
#define NVIC_ISPR1_SETPEND36   0x10U         // Set INTR36 Pending
#define NVIC_ISPR1_SETPEND37   0x20U         // Set INTR37 Pending
#define NVIC_ISPR1_SETPEND38   0x40U         // Set INTR38 Pending
#define NVIC_ISPR1_SETPEND39   0x80U         // Set INTR39 Pending
#define NVIC_ISPR1_SETPEND40   0x100U        // Set INTR40 Pending
#define NVIC_ISPR1_SETPEND41   0x200U        // Set INTR41 Pending
#define NVIC_ISPR1_SETPEND42   0x400U        // Set INTR42 Pending
#define NVIC_ISPR1_SETPEND43   0x800U        // Set INTR43 Pending
#define NVIC_ISPR1_SETPEND44   0x1000U       // Set INTR44 Pending
#define NVIC_ISPR1_SETPEND45   0x2000U       // Set INTR45 Pending
#define NVIC_ISPR1_SETPEND46   0x4000U       // Set INTR46 Pending
#define NVIC_ISPR1_SETPEND47   0x8000U       // Set INTR47 Pending
#define NVIC_ISPR1_SETPEND48   0x10000U      // Set INTR48 Pending
#define NVIC_ISPR1_SETPEND49   0x20000U      // Set INTR49 Pending
#define NVIC_ISPR1_SETPEND50   0x40000U      // Set INTR50 Pending
#define NVIC_ISPR1_SETPEND51   0x80000U      // Set INTR51 Pending
#define NVIC_ISPR1_SETPEND52   0x100000U     // Set INTR52 Pending
#define NVIC_ISPR1_SETPEND53   0x200000U     // Set INTR53 Pending
#define NVIC_ISPR1_SETPEND54   0x400000U     // Set INTR54 Pending
#define NVIC_ISPR1_SETPEND55   0x800000U     // Set INTR55 Pending
#define NVIC_ISPR1_SETPEND56   0x1000000U    // Set INTR56 Pending
#define NVIC_ISPR1_SETPEND57   0x2000000U    // Set INTR57 Pending
#define NVIC_ISPR1_SETPEND58   0x4000000U    // Set INTR58 Pending
#define NVIC_ISPR1_SETPEND59   0x8000000U    // Set INTR59 Pending
#define NVIC_ISPR1_SETPEND60   0x10000000U   // Set INTR60 Pending
#define NVIC_ISPR1_SETPEND61   0x20000000U   // Set INTR61 Pending
#define NVIC_ISPR1_SETPEND62   0x40000000U   // Set INTR62 Pending
#define NVIC_ISPR1_SETPEND63   0x80000000U   // Set INTR63 Pending

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_ISPR2 register
//
//*************************************************************************************************
#define NVIC_ISPR2_SETPEND64   0x1U          // Set INTR64 Pending
#define NVIC_ISPR2_SETPEND65   0x2U          // Set INTR65 Pending
#define NVIC_ISPR2_SETPEND66   0x4U          // Set INTR66 Pending
#define NVIC_ISPR2_SETPEND67   0x8U          // Set INTR67 Pending
#define NVIC_ISPR2_SETPEND68   0x10U         // Set INTR68 Pending
#define NVIC_ISPR2_SETPEND69   0x20U         // Set INTR69 Pending
#define NVIC_ISPR2_SETPEND70   0x40U         // Set INTR70 Pending
#define NVIC_ISPR2_SETPEND71   0x80U         // Set INTR71 Pending
#define NVIC_ISPR2_SETPEND72   0x100U        // Set INTR72 Pending
#define NVIC_ISPR2_SETPEND73   0x200U        // Set INTR73 Pending
#define NVIC_ISPR2_SETPEND74   0x400U        // Set INTR74 Pending
#define NVIC_ISPR2_SETPEND75   0x800U        // Set INTR75 Pending
#define NVIC_ISPR2_SETPEND76   0x1000U       // Set INTR76 Pending
#define NVIC_ISPR2_SETPEND77   0x2000U       // Set INTR77 Pending
#define NVIC_ISPR2_SETPEND78   0x4000U       // Set INTR78 Pending
#define NVIC_ISPR2_SETPEND79   0x8000U       // Set INTR79 Pending
#define NVIC_ISPR2_SETPEND80   0x10000U      // Set INTR80 Pending
#define NVIC_ISPR2_SETPEND81   0x20000U      // Set INTR81 Pending
#define NVIC_ISPR2_SETPEND82   0x40000U      // Set INTR82 Pending
#define NVIC_ISPR2_SETPEND83   0x80000U      // Set INTR83 Pending
#define NVIC_ISPR2_SETPEND84   0x100000U     // Set INTR84 Pending
#define NVIC_ISPR2_SETPEND85   0x200000U     // Set INTR85 Pending
#define NVIC_ISPR2_SETPEND86   0x400000U     // Set INTR86 Pending
#define NVIC_ISPR2_SETPEND87   0x800000U     // Set INTR87 Pending
#define NVIC_ISPR2_SETPEND88   0x1000000U    // Set INTR88 Pending
#define NVIC_ISPR2_SETPEND89   0x2000000U    // Set INTR89 Pending
#define NVIC_ISPR2_SETPEND90   0x4000000U    // Set INTR90 Pending
#define NVIC_ISPR2_SETPEND91   0x8000000U    // Set INTR91 Pending
#define NVIC_ISPR2_SETPEND92   0x10000000U   // Set INTR92 Pending
#define NVIC_ISPR2_SETPEND93   0x20000000U   // Set INTR93 Pending
#define NVIC_ISPR2_SETPEND94   0x40000000U   // Set INTR94 Pending
#define NVIC_ISPR2_SETPEND95   0x80000000U   // Set INTR95 Pending

