TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_nvic.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_ICPR0 register
//
//*************************************************************************************************
#define NVIC_ICPR0_CLRPEND0    0x1U          // Clear INTR0 Pending
#define NVIC_ICPR0_CLRPEND1    0x2U          // Clear INTR1 Pending
#define NVIC_ICPR0_CLRPEND2    0x4U          // Clear INTR2 Pending
#define NVIC_ICPR0_CLRPEND3    0x8U          // Clear INTR3 Pending
#define NVIC_ICPR0_CLRPEND4    0x10U         // Clear INTR4 Pending
#define NVIC_ICPR0_CLRPEND5    0x20U         // Clear INTR5 Pending
#define NVIC_ICPR0_CLRPEND6    0x40U         // Clear INTR6 Pending
#define NVIC_ICPR0_CLRPEND7    0x80U         // Clear INTR7 Pending
#define NVIC_ICPR0_CLRPEND8    0x100U        // Clear INTR8 Pending
#define NVIC_ICPR0_CLRPEND9    0x200U        // Clear INTR9 Pending
#define NVIC_ICPR0_CLRPEND10   0x400U        // Clear INTR10 Pending
#define NVIC_ICPR0_CLRPEND11   0x800U        // Clear INTR11 Pending
#define NVIC_ICPR0_CLRPEND12   0x1000U       // Clear INTR12 Pending
#define NVIC_ICPR0_CLRPEND13   0x2000U       // Clear INTR13 Pending
#define NVIC_ICPR0_CLRPEND14   0x4000U       // Clear INTR14 Pending
#define NVIC_ICPR0_CLRPEND15   0x8000U       // Clear INTR15 Pending
#define NVIC_ICPR0_CLRPEND16   0x10000U      // Clear INTR16 Pending
#define NVIC_ICPR0_CLRPEND17   0x20000U      // Clear INTR17 Pending
#define NVIC_ICPR0_CLRPEND18   0x40000U      // Clear INTR18 Pending
#define NVIC_ICPR0_CLRPEND19   0x80000U      // Clear INTR19 Pending
#define NVIC_ICPR0_CLRPEND20   0x100000U     // Clear INTR20 Pending
#define NVIC_ICPR0_CLRPEND21   0x200000U     // Clear INTR21 Pending
#define NVIC_ICPR0_CLRPEND22   0x400000U     // Clear INTR22 Pending
#define NVIC_ICPR0_CLRPEND23   0x800000U     // Clear INTR23 Pending
#define NVIC_ICPR0_CLRPEND24   0x1000000U    // Clear INTR24 Pending
#define NVIC_ICPR0_CLRPEND25   0x2000000U    // Clear INTR25 Pending
#define NVIC_ICPR0_CLRPEND26   0x4000000U    // Clear INTR26 Pending
#define NVIC_ICPR0_CLRPEND27   0x8000000U    // Clear INTR27 Pending
#define NVIC_ICPR0_CLRPEND28   0x10000000U   // Clear INTR28 Pending
#define NVIC_ICPR0_CLRPEND29   0x20000000U   // Clear INTR29 Pending
#define NVIC_ICPR0_CLRPEND30   0x40000000U   // Clear INTR30 Pending
#define NVIC_ICPR0_CLRPEND31   0x80000000U   // Clear INTR31 Pending

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_ICPR1 register
//
//*************************************************************************************************
#define NVIC_ICPR1_CLRPEND32   0x1U          // Clear INTR32 Pending
#define NVIC_ICPR1_CLRPEND33   0x2U          // Clear INTR33 Pending
#define NVIC_ICPR1_CLRPEND34   0x4U          // Clear INTR34 Pending
#define NVIC_ICPR1_CLRPEND35   0x8U          // Clear INTR35 Pending
#define NVIC_ICPR1_CLRPEND36   0x10U         // Clear INTR36 Pending
#define NVIC_ICPR1_CLRPEND37   0x20U         // Clear INTR37 Pending
#define NVIC_ICPR1_CLRPEND38   0x40U         // Clear INTR38 Pending
#define NVIC_ICPR1_CLRPEND39   0x80U         // Clear INTR39 Pending
#define NVIC_ICPR1_CLRPEND40   0x100U        // Clear INTR40 Pending
#define NVIC_ICPR1_CLRPEND41   0x200U        // Clear INTR41 Pending
#define NVIC_ICPR1_CLRPEND42   0x400U        // Clear INTR42 Pending
#define NVIC_ICPR1_CLRPEND43   0x800U        // Clear INTR43 Pending
#define NVIC_ICPR1_CLRPEND44   0x1000U       // Clear INTR44 Pending
#define NVIC_ICPR1_CLRPEND45   0x2000U       // Clear INTR45 Pending
#define NVIC_ICPR1_CLRPEND46   0x4000U       // Clear INTR46 Pending
#define NVIC_ICPR1_CLRPEND47   0x8000U       // Clear INTR47 Pending
#define NVIC_ICPR1_CLRPEND48   0x10000U      // Clear INTR48 Pending
#define NVIC_ICPR1_CLRPEND49   0x20000U      // Clear INTR49 Pending
#define NVIC_ICPR1_CLRPEND50   0x40000U      // Clear INTR50 Pending
#define NVIC_ICPR1_CLRPEND51   0x80000U      // Clear INTR51 Pending
#define NVIC_ICPR1_CLRPEND52   0x100000U     // Clear INTR52 Pending
#define NVIC_ICPR1_CLRPEND53   0x200000U     // Clear INTR53 Pending
#define NVIC_ICPR1_CLRPEND54   0x400000U     // Clear INTR54 Pending
#define NVIC_ICPR1_CLRPEND55   0x800000U     // Clear INTR55 Pending
#define NVIC_ICPR1_CLRPEND56   0x1000000U    // Clear INTR56 Pending
#define NVIC_ICPR1_CLRPEND57   0x2000000U    // Clear INTR57 Pending
#define NVIC_ICPR1_CLRPEND58   0x4000000U    // Clear INTR58 Pending
#define NVIC_ICPR1_CLRPEND59   0x8000000U    // Clear INTR59 Pending
#define NVIC_ICPR1_CLRPEND60   0x10000000U   // Clear INTR60 Pending
#define NVIC_ICPR1_CLRPEND61   0x20000000U   // Clear INTR61 Pending
#define NVIC_ICPR1_CLRPEND62   0x40000000U   // Clear INTR62 Pending
#define NVIC_ICPR1_CLRPEND63   0x80000000U   // Clear INTR63 Pending

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IABR0 register
//
//*************************************************************************************************
#define NVIC_IABR0_ACTIVE0    0x1U          // INTR0 Active
#define NVIC_IABR0_ACTIVE1    0x2U          // INTR1 Active
#define NVIC_IABR0_ACTIVE2    0x4U          // INTR2 Active
#define NVIC_IABR0_ACTIVE3    0x8U          // INTR3 Active
#define NVIC_IABR0_ACTIVE4    0x10U         // INTR4 Active
#define NVIC_IABR0_ACTIVE5    0x20U         // INTR5 Active
#define NVIC_IABR0_ACTIVE6    0x40U         // INTR6 Active
#define NVIC_IABR0_ACTIVE7    0x80U         // INTR7 Active
#define NVIC_IABR0_ACTIVE8    0x100U        // INTR8 Active
#define NVIC_IABR0_ACTIVE9    0x200U        // INTR9 Active
#define NVIC_IABR0_ACTIVE10   0x400U        // INTR10 Active
#define NVIC_IABR0_ACTIVE11   0x800U        // INTR11 Active
#define NVIC_IABR0_ACTIVE12   0x1000U       // INTR12 Active
#define NVIC_IABR0_ACTIVE13   0x2000U       // INTR13 Active
#define NVIC_IABR0_ACTIVE14   0x4000U       // INTR14 Active
#define NVIC_IABR0_ACTIVE15   0x8000U       // INTR15 Active
#define NVIC_IABR0_ACTIVE16   0x10000U      // INTR16 Active
#define NVIC_IABR0_ACTIVE17   0x20000U      // INTR17 Active
#define NVIC_IABR0_ACTIVE18   0x40000U      // INTR18 Active
#define NVIC_IABR0_ACTIVE19   0x80000U      // INTR19 Active
#define NVIC_IABR0_ACTIVE20   0x100000U     // INTR20 Active
#define NVIC_IABR0_ACTIVE21   0x200000U     // INTR21 Active
#define NVIC_IABR0_ACTIVE22   0x400000U     // INTR22 Active
#define NVIC_IABR0_ACTIVE23   0x800000U     // INTR23 Active
#define NVIC_IABR0_ACTIVE24   0x1000000U    // INTR24 Active
#define NVIC_IABR0_ACTIVE25   0x2000000U    // INTR25 Active
#define NVIC_IABR0_ACTIVE26   0x4000000U    // INTR26 Active
#define NVIC_IABR0_ACTIVE27   0x8000000U    // INTR27 Active
#define NVIC_IABR0_ACTIVE28   0x10000000U   // INTR28 Active
#define NVIC_IABR0_ACTIVE29   0x20000000U   // INTR29 Active
#define NVIC_IABR0_ACTIVE30   0x40000000U   // INTR30 Active
#define NVIC_IABR0_ACTIVE31   0x80000000U   // INTR31 Active

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IABR1 register
//
//*************************************************************************************************
#define NVIC_IABR1_ACTIVE32   0x1U          // INTR32 Active
#define NVIC_IABR1_ACTIVE33   0x2U          // INTR33 Active
#define NVIC_IABR1_ACTIVE34   0x4U          // INTR34 Active
#define NVIC_IABR1_ACTIVE35   0x8U          // INTR35 Active
#define NVIC_IABR1_ACTIVE36   0x10U         // INTR36 Active
#define NVIC_IABR1_ACTIVE37   0x20U         // INTR37 Active
#define NVIC_IABR1_ACTIVE38   0x40U         // INTR38 Active
#define NVIC_IABR1_ACTIVE39   0x80U         // INTR39 Active
#define NVIC_IABR1_ACTIVE40   0x100U        // INTR40 Active
#define NVIC_IABR1_ACTIVE41   0x200U        // INTR41 Active
#define NVIC_IABR1_ACTIVE42   0x400U        // INTR42 Active
#define NVIC_IABR1_ACTIVE43   0x800U        // INTR43 Active
#define NVIC_IABR1_ACTIVE44   0x1000U       // INTR44 Active
#define NVIC_IABR1_ACTIVE45   0x2000U       // INTR45 Active
#define NVIC_IABR1_ACTIVE46   0x4000U       // INTR46 Active
#define NVIC_IABR1_ACTIVE47   0x8000U       // INTR47 Active
#define NVIC_IABR1_ACTIVE48   0x10000U      // INTR48 Active
#define NVIC_IABR1_ACTIVE49   0x20000U      // INTR49 Active
#define NVIC_IABR1_ACTIVE50   0x40000U      // INTR50 Active
#define NVIC_IABR1_ACTIVE51   0x80000U      // INTR51 Active
#define NVIC_IABR1_ACTIVE52   0x100000U     // INTR52 Active
#define NVIC_IABR1_ACTIVE53   0x200000U     // INTR53 Active
#define NVIC_IABR1_ACTIVE54   0x400000U     // INTR54 Active
#define NVIC_IABR1_ACTIVE55   0x800000U     // INTR55 Active
#define NVIC_IABR1_ACTIVE56   0x1000000U    // INTR56 Active
#define NVIC_IABR1_ACTIVE57   0x2000000U    // INTR57 Active
#define NVIC_IABR1_ACTIVE58   0x4000000U    // INTR58 Active
#define NVIC_IABR1_ACTIVE59   0x8000000U    // INTR59 Active
#define NVIC_IABR1_ACTIVE60   0x10000000U   // INTR60 Active
#define NVIC_IABR1_ACTIVE61   0x20000000U   // INTR61 Active
#define NVIC_IABR1_ACTIVE62   0x40000000U   // INTR62 Active
#define NVIC_IABR1_ACTIVE63   0x80000000U   // INTR63 Active

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR0 register
//
//*************************************************************************************************
#define NVIC_IPR0_PRI_0_S   5U
#define NVIC_IPR0_PRI_0_M   0xE0U         // Priority, byte offset 0
#define NVIC_IPR0_PRI_1_S   13U
#define NVIC_IPR0_PRI_1_M   0xE000U       // Priority, byte offset 1
#define NVIC_IPR0_PRI_2_S   21U
#define NVIC_IPR0_PRI_2_M   0xE00000U     // Priority, byte offset 2
#define NVIC_IPR0_PRI_3_S   29U
#define NVIC_IPR0_PRI_3_M   0xE0000000U   // Priority, byte offset 3

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR1 register
//
//*************************************************************************************************
#define NVIC_IPR1_PRI_4_S   5U
#define NVIC_IPR1_PRI_4_M   0xE0U         // Priority, byte offset 4
#define NVIC_IPR1_PRI_5_S   13U
#define NVIC_IPR1_PRI_5_M   0xE000U       // Priority, byte offset 5
#define NVIC_IPR1_PRI_6_S   21U
#define NVIC_IPR1_PRI_6_M   0xE00000U     // Priority, byte offset 6
#define NVIC_IPR1_PRI_7_S   29U
#define NVIC_IPR1_PRI_7_M   0xE0000000U   // Priority, byte offset 7

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR2 register
//
//*************************************************************************************************
#define NVIC_IPR2_PRI_8_S    5U
#define NVIC_IPR2_PRI_8_M    0xE0U         // Priority, byte offset 8
#define NVIC_IPR2_PRI_9_S    13U
#define NVIC_IPR2_PRI_9_M    0xE000U       // Priority, byte offset 9
#define NVIC_IPR2_PRI_10_S   21U
#define NVIC_IPR2_PRI_10_M   0xE00000U     // Priority, byte offset 10
#define NVIC_IPR2_PRI_11_S   29U
#define NVIC_IPR2_PRI_11_M   0xE0000000U   // Priority, byte offset 11

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR3 register
//
//*************************************************************************************************
#define NVIC_IPR3_PRI_12_S   5U
#define NVIC_IPR3_PRI_12_M   0xE0U         // Priority, byte offset 12
#define NVIC_IPR3_PRI_13_S   13U
#define NVIC_IPR3_PRI_13_M   0xE000U       // Priority, byte offset 13
#define NVIC_IPR3_PRI_14_S   21U
#define NVIC_IPR3_PRI_14_M   0xE00000U     // Priority, byte offset 14
#define NVIC_IPR3_PRI_15_S   29U
#define NVIC_IPR3_PRI_15_M   0xE0000000U   // Priority, byte offset 15

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR4 register
//
//*************************************************************************************************
#define NVIC_IPR4_PRI_16_S   5U
#define NVIC_IPR4_PRI_16_M   0xE0U         // Priority, byte offset 16
#define NVIC_IPR4_PRI_17_S   13U
#define NVIC_IPR4_PRI_17_M   0xE000U       // Priority, byte offset 17
#define NVIC_IPR4_PRI_18_S   21U
#define NVIC_IPR4_PRI_18_M   0xE00000U     // Priority, byte offset 18
#define NVIC_IPR4_PRI_19_S   29U
#define NVIC_IPR4_PRI_19_M   0xE0000000U   // Priority, byte offset 19

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR5 register
//
//*************************************************************************************************
#define NVIC_IPR5_PRI_20_S   5U
#define NVIC_IPR5_PRI_20_M   0xE0U         // Priority, byte offset 20
#define NVIC_IPR5_PRI_21_S   13U
#define NVIC_IPR5_PRI_21_M   0xE000U       // Priority, byte offset 21
#define NVIC_IPR5_PRI_22_S   21U
#define NVIC_IPR5_PRI_22_M   0xE00000U     // Priority, byte offset 22
#define NVIC_IPR5_PRI_23_S   29U
#define NVIC_IPR5_PRI_23_M   0xE0000000U   // Priority, byte offset 23

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR6 register
//
//*************************************************************************************************
#define NVIC_IPR6_PRI_24_S   5U
#define NVIC_IPR6_PRI_24_M   0xE0U         // Priority, byte offset 24
#define NVIC_IPR6_PRI_25_S   13U
#define NVIC_IPR6_PRI_25_M   0xE000U       // Priority, byte offset 25
#define NVIC_IPR6_PRI_26_S   21U
#define NVIC_IPR6_PRI_26_M   0xE00000U     // Priority, byte offset 26
#define NVIC_IPR6_PRI_27_S   29U
#define NVIC_IPR6_PRI_27_M   0xE0000000U   // Priority, byte offset 27

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR7 register
//
//*************************************************************************************************
#define NVIC_IPR7_PRI_28_S   5U
#define NVIC_IPR7_PRI_28_M   0xE0U         // Priority, byte offset 28
#define NVIC_IPR7_PRI_29_S   13U
#define NVIC_IPR7_PRI_29_M   0xE000U       // Priority, byte offset 29
#define NVIC_IPR7_PRI_30_S   21U
#define NVIC_IPR7_PRI_30_M   0xE00000U     // Priority, byte offset 30
#define NVIC_IPR7_PRI_31_S   29U
#define NVIC_IPR7_PRI_31_M   0xE0000000U   // Priority, byte offset 31

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR8 register
//
//*************************************************************************************************
#define NVIC_IPR8_PRI_32_S   5U
#define NVIC_IPR8_PRI_32_M   0xE0U         // Priority, byte offset 32
#define NVIC_IPR8_PRI_33_S   13U
#define NVIC_IPR8_PRI_33_M   0xE000U       // Priority, byte offset 33
#define NVIC_IPR8_PRI_34_S   21U
#define NVIC_IPR8_PRI_34_M   0xE00000U     // Priority, byte offset 34
#define NVIC_IPR8_PRI_35_S   29U
#define NVIC_IPR8_PRI_35_M   0xE0000000U   // Priority, byte offset 35

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR9 register
//
//*************************************************************************************************
#define NVIC_IPR9_PRI_36_S   5U
#define NVIC_IPR9_PRI_36_M   0xE0U         // Priority, byte offset 36
#define NVIC_IPR9_PRI_37_S   13U
#define NVIC_IPR9_PRI_37_M   0xE000U       // Priority, byte offset 37
#define NVIC_IPR9_PRI_38_S   21U
#define NVIC_IPR9_PRI_38_M   0xE00000U     // Priority, byte offset 38
#define NVIC_IPR9_PRI_39_S   29U
#define NVIC_IPR9_PRI_39_M   0xE0000000U   // Priority, byte offset 39

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR10 register
//
//*************************************************************************************************
#define NVIC_IPR10_PRI_40_S   5U
#define NVIC_IPR10_PRI_40_M   0xE0U         // Priority, byte offset 40
#define NVIC_IPR10_PRI_41_S   13U
#define NVIC_IPR10_PRI_41_M   0xE000U       // Priority, byte offset 41
#define NVIC_IPR10_PRI_42_S   21U
#define NVIC_IPR10_PRI_42_M   0xE00000U     // Priority, byte offset 42
#define NVIC_IPR10_PRI_43_S   29U
#define NVIC_IPR10_PRI_43_M   0xE0000000U   // Priority, byte offset 43

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR11 register
//
//*************************************************************************************************
#define NVIC_IPR11_PRI_44_S   5U
#define NVIC_IPR11_PRI_44_M   0xE0U         // Priority, byte offset 44
#define NVIC_IPR11_PRI_45_S   13U
#define NVIC_IPR11_PRI_45_M   0xE000U       // Priority, byte offset 45
#define NVIC_IPR11_PRI_46_S   21U
#define NVIC_IPR11_PRI_46_M   0xE00000U     // Priority, byte offset 46
#define NVIC_IPR11_PRI_47_S   29U
#define NVIC_IPR11_PRI_47_M   0xE0000000U   // Priority, byte offset 47

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR12 register
//
//*************************************************************************************************
#define NVIC_IPR12_PRI_48_S   5U
#define NVIC_IPR12_PRI_48_M   0xE0U         // Priority, byte offset 48
#define NVIC_IPR12_PRI_49_S   13U
#define NVIC_IPR12_PRI_49_M   0xE000U       // Priority, byte offset 49
#define NVIC_IPR12_PRI_50_S   21U
#define NVIC_IPR12_PRI_50_M   0xE00000U     // Priority, byte offset 50
#define NVIC_IPR12_PRI_51_S   29U
#define NVIC_IPR12_PRI_51_M   0xE0000000U   // Priority, byte offset 51

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR13 register
//
//*************************************************************************************************
#define NVIC_IPR13_PRI_52_S   5U
#define NVIC_IPR13_PRI_52_M   0xE0U         // Priority, byte offset 52
#define NVIC_IPR13_PRI_53_S   13U
#define NVIC_IPR13_PRI_53_M   0xE000U       // Priority, byte offset 53
#define NVIC_IPR13_PRI_54_S   21U
#define NVIC_IPR13_PRI_54_M   0xE00000U     // Priority, byte offset 54
#define NVIC_IPR13_PRI_55_S   29U
#define NVIC_IPR13_PRI_55_M   0xE0000000U   // Priority, byte offset 55

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR14 register
//
//*************************************************************************************************
#define NVIC_IPR14_PRI_56_S   5U
#define NVIC_IPR14_PRI_56_M   0xE0U         // Priority, byte offset 56
#define NVIC_IPR14_PRI_57_S   13U
#define NVIC_IPR14_PRI_57_M   0xE000U       // Priority, byte offset 57
#define NVIC_IPR14_PRI_58_S   21U
#define NVIC_IPR14_PRI_58_M   0xE00000U     // Priority, byte offset 58
#define NVIC_IPR14_PRI_59_S   29U
#define NVIC_IPR14_PRI_59_M   0xE0000000U   // Priority, byte offset 59

//*************************************************************************************************
//
// The following are defines for the bit fields in the NVIC_IPR15 register
//
//*************************************************************************************************
#define NVIC_IPR15_PRI_60_S   5U
#define NVIC_IPR15_PRI_60_M   0xE0U         // Priority, byte offset 60
#define NVIC_IPR15_PRI_61_S   13U
#define NVIC_IPR15_PRI_61_M   0xE000U       // Priority, byte offset 61
#define NVIC_IPR15_PRI_62_S   21U
#define NVIC_IPR15_PRI_62_M   0xE00000U     // Priority, byte offset 62
#define NVIC_IPR15_PRI_63_S   29U
#define NVIC_IPR15_PRI_63_M   0xE0000000U   // Priority, byte offset 63

//*************************************************************************************************
//
// The following are defines for the bit fields in the STIR register
//
//*************************************************************************************************
#define NVIC_STIR_INTID_S   0U
#define NVIC_STIR_INTID_M   0x1FFU   // Software Trigger Interrupt Register.


//*************************************************************************************************
//
// The following are defines for the bit fields in the ACTLR register
//
//*************************************************************************************************
#define NVIC_ACTLR_DISMCYCINT   0x1U     // Disable interruption of load/store multiple
                                         // instruction.
#define NVIC_ACTLR_DISDEFWBUF   0x2U     // Disable write buffer on default memory map.
#define NVIC_ACTLR_DISFOLD      0x4U     // Disables IT folding.
#define NVIC_ACTLR_DISFPCA      0x100U   // Disables automatic update of CONTROL.FPCA.

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUID register
//
//*************************************************************************************************
#define NVIC_CPUID_REVISION_S      0U
#define NVIC_CPUID_REVISION_M      0xFU          // Revision
#define NVIC_CPUID_PARTNO_S        4U
#define NVIC_CPUID_PARTNO_M        0xFFF0U       // PartNo
#define NVIC_CPUID_CONSTANT_S      16U
#define NVIC_CPUID_CONSTANT_M      0xF0000U      // Constant
#define NVIC_CPUID_VARIANT_S       20U
#define NVIC_CPUID_VARIANT_M       0xF00000U     // Variant
#define NVIC_CPUID_IMPLEMENTER_S   24U
#define NVIC_CPUID_IMPLEMENTER_M   0xFF000000U   // Implementer

//*************************************************************************************************
//
// The following are defines for the bit fields in the ICSR register
//
//*************************************************************************************************
#define NVIC_ICSR_VECTACTIVE_S    0U
#define NVIC_ICSR_VECTACTIVE_M    0x1FFU        //  Active exception number
#define NVIC_ICSR_RETTOBASE       0x800U        // Indicates presence of preempted active
                                                // exceptions.
#define NVIC_ICSR_VECTPENDING_S   12U
#define NVIC_ICSR_VECTPENDING_M   0x3F000U      // Exception number of highest priority pending
                                                // exception.
#define NVIC_ICSR_ISRPENDING      0x400000U     // Interrupt pending flag
#define NVIC_ICSR_PENDSTCLR       0x2000000U    // SysTick exception clear-pending bit
#define NVIC_ICSR_PENDSTSET       0x4000000U    // SysTick exception set-pending bit.
#define NVIC_ICSR_PENDSVCLR       0x8000000U    // PendSV clear-pending bit.
#define NVIC_ICSR_PENDSVSET       0x10000000U   // PendSV set-pending bit.
#define NVIC_ICSR_NMIPENDSET      0x80000000U   // NMI set-pending bit.

//*************************************************************************************************
//
// The following are defines for the bit fields in the VTOR register
//
//*************************************************************************************************
#define NVIC_VTOR_TBLOFF_S   7U
#define NVIC_VTOR_TBLOFF_M   0xFFFFFF80U   // Vector table offset.

