TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_nvic.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the AIRCR register
//
//*************************************************************************************************
#define NVIC_AIRCR_VECTRESET       0x1U          // CPU Reset
#define NVIC_AIRCR_VECTCLRACTIVE   0x2U          // Reserved for Debug use.
#define NVIC_AIRCR_SYSRESETREQ     0x4U          // System reset request bit
#define NVIC_AIRCR_PRIGROUP_S      8U
#define NVIC_AIRCR_PRIGROUP_M      0x700U        // Interrupt priority grouping field
#define NVIC_AIRCR_ENDIANNESS      0x8000U       // Data endianness bit
#define NVIC_AIRCR_VECTKEY_S       16U
#define NVIC_AIRCR_VECTKEY_M       0xFFFF0000U   // Vector Key.

//*************************************************************************************************
//
// The following are defines for the bit fields in the SCR register
//
//*************************************************************************************************
#define NVIC_SCR_SLEEPONEXIT   0x2U   // sleep-on-exit when returning from Handler mode.

//*************************************************************************************************
//
// The following are defines for the bit fields in the CCR register
//
//*************************************************************************************************
#define NVIC_CCR_NONBASETHRDENA   0x1U     // Indicates how the processor enters Thread mode
#define NVIC_CCR_USERSETMPEND     0x2U     // Enables unprivileged software access to the STIR.
#define NVIC_CCR_UNALIGN_TRP      0x8U     // Enables unaligned access traps.
#define NVIC_CCR_DIV_0_TRP        0x10U    // faulting/halting on DIV by 0 exception.
#define NVIC_CCR_BFHFNMIGN        0x100U   // Ignore data BusFaults caused by load and store
                                           // instructions.
#define NVIC_CCR_STKALIGN         0x200U   // Indicates stack alignment on exception entry.

//*************************************************************************************************
//
// The following are defines for the bit fields in the SHPR1 register
//
//*************************************************************************************************
#define NVIC_SHPR1_PRI_4_S   5U
#define NVIC_SHPR1_PRI_4_M   0xE0U       // Priority of system handler 4, MemManage
#define NVIC_SHPR1_PRI_5_S   13U
#define NVIC_SHPR1_PRI_5_M   0xE000U     // Priority of system handler 5,  BusFault
#define NVIC_SHPR1_PRI_6_S   21U
#define NVIC_SHPR1_PRI_6_M   0xE00000U   // Priority of system handler 6, UsageFault

//*************************************************************************************************
//
// The following are defines for the bit fields in the SHPR2 register
//
//*************************************************************************************************
#define NVIC_SHPR2_PRI_11_S   29U
#define NVIC_SHPR2_PRI_11_M   0xE0000000U   // Priority of system handler 11, SVCall

//*************************************************************************************************
//
// The following are defines for the bit fields in the SHPR3 register
//
//*************************************************************************************************
#define NVIC_SHPR3_PRI_14_S   21U
#define NVIC_SHPR3_PRI_14_M   0xE00000U     // Priority of system handler 14, PendSV
#define NVIC_SHPR3_PRI_15_S   29U
#define NVIC_SHPR3_PRI_15_M   0xE0000000U   // Priority of system handler 15, SysTick exception

//*************************************************************************************************
//
// The following are defines for the bit fields in the SHCSRS register
//
//*************************************************************************************************
#define NVIC_SHCSRS_MEMFAULTACT      0x1U       // MemManage exception active bit
#define NVIC_SHCSRS_BUSFAULTACT      0x2U       // BusFault exception active bit
#define NVIC_SHCSRS_USGFAULTACT      0x8U       // UsageFault exception active bit
#define NVIC_SHCSRS_SVCALLACT        0x80U      // SVCall active bit
#define NVIC_SHCSRS_MONITORACT       0x100U     // Debug monitor active bit
#define NVIC_SHCSRS_PENDSVACT        0x400U     // PendSV exception active bit
#define NVIC_SHCSRS_SYSTICKACT       0x800U     // SysTick exception active bit
#define NVIC_SHCSRS_USGFAULTPENDED   0x1000U    // UsageFault exception pending bit
#define NVIC_SHCSRS_MEMFAULTPENDED   0x2000U    // MemManage exception pending bit
#define NVIC_SHCSRS_BUSFAULTPENDED   0x4000U    // BusFault exception pending bit
#define NVIC_SHCSRS_SVCALLPENDED     0x8000U    // SVCall pending bit
#define NVIC_SHCSRS_MEMFAULTENA      0x10000U   // MemManage enable bit
#define NVIC_SHCSRS_BUSFAULTENA      0x20000U   // BusFault enable bit
#define NVIC_SHCSRS_USGFAULTENA      0x40000U   // UsageFault enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CFSR register
//
//*************************************************************************************************
#define NVIC_CFSR_IACCVIOL      0x1U         // Instruction access violation flag
#define NVIC_CFSR_DACCVIOL      0x2U         // Data access violation flag
#define NVIC_CFSR_MUNSTKERR     0x8U         // MemManage fault on unstacking for a return from
                                             // exception
#define NVIC_CFSR_MSTKERR       0x10U        // MemManage fault on stacking for exception entry
#define NVIC_CFSR_MMARVALID     0x80U        // MemManage Fault Address Register (MMFAR) valid flag
#define NVIC_CFSR_IBUSERR       0x100U       // Instruction bus error
#define NVIC_CFSR_PRECISERR     0x200U       // Precise data bus error
#define NVIC_CFSR_IMPRECISERR   0x400U       // Imprecise data bus error
#define NVIC_CFSR_UNSTKERR      0x800U       // BusFault on unstacking for a return from exception
#define NVIC_CFSR_STKERR        0x1000U      // BusFault on stacking for exception entry
#define NVIC_CFSR_BFARVALID     0x8000U      // BusFault Address Register (BFAR) valid flag
#define NVIC_CFSR_UNDEFINSTR    0x10000U     // Undefined instruction UsageFault
#define NVIC_CFSR_INVSTATE      0x20000U     // Invalid state UsageFault
#define NVIC_CFSR_INVPC         0x40000U     // Invalid PC load UsageFault
#define NVIC_CFSR_NOCP          0x80000U     // No coprocessor UsageFault
#define NVIC_CFSR_UNALIGNED     0x1000000U   // Unaligned access UsageFault
#define NVIC_CFSR_DIVBYZERO     0x2000000U   // Divide by zero UsageFault

//*************************************************************************************************
//
// The following are defines for the bit fields in the HFSR register
//
//*************************************************************************************************
#define NVIC_HFSR_VECTTBL    0x2U          // BusFault on a vector table read.
#define NVIC_HFSR_FORCED     0x40000000U   // Indicates a forced hard fault
#define NVIC_HFSR_DEBUGEVT   0x80000000U   // Indicates a forced DEBUG event fault


//*************************************************************************************************
//
// The following are defines for the bit fields in the MMSR register
//
//*************************************************************************************************
#define NVIC_MMSR_IACCVIOL    0x1U    // Instruction access violation flag
#define NVIC_MMSR_DACCVIOL    0x2U    // Data access violation flag
#define NVIC_MMSR_MUNSTKERR   0x8U    // MemManage fault on unstacking for a return from exception
#define NVIC_MMSR_MSTKERR     0x10U   // MemManage fault on stacking for exception entry
#define NVIC_MMSR_MMARVALID   0x80U   // MemManage Fault Address Register (MMFAR) valid flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the BFSR register
//
//*************************************************************************************************
#define NVIC_BFSR_IBUSERR       0x1U    // Instruction bus error
#define NVIC_BFSR_PRECISERR     0x2U    // Precise data bus error
#define NVIC_BFSR_IMPRECISERR   0x4U    // Imprecise data bus error
#define NVIC_BFSR_UNSTKERR      0x8U    // BusFault on unstacking for a return from exception
#define NVIC_BFSR_STKERR        0x10U   // BusFault on stacking for exception entry
#define NVIC_BFSR_BFARVALID     0x80U   // BusFault Address Register (BFAR) valid flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the UFSR register
//
//*************************************************************************************************
#define NVIC_UFSR_UNDEFINSTR   0x1U     // Undefined instruction UsageFault
#define NVIC_UFSR_INVSTATE     0x2U     // Invalid state UsageFault
#define NVIC_UFSR_INVPC        0x4U     // Invalid PC load UsageFault
#define NVIC_UFSR_NOCP         0x8U     // No coprocessor UsageFault
#define NVIC_UFSR_UNALIGNED    0x100U   // Unaligned access UsageFault
#define NVIC_UFSR_DIVBYZERO    0x200U   // Divide by zero UsageFault


//*************************************************************************************************
//
// The following are defines for the bit fields in the SYST_CSR register
//
//*************************************************************************************************
#define NVIC_SYST_CSR_ENABLE      0x1U       // Enables the counter
#define NVIC_SYST_CSR_TICKINT     0x2U       // Enables SysTick exception request
#define NVIC_SYST_CSR_CLKSOURCE   0x4U       // Indicates the clock source
#define NVIC_SYST_CSR_COUNTFLAG   0x10000U   // timer counted to 0 since last read.

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYST_RVR register
//
//*************************************************************************************************
#define NVIC_SYST_RVR_RELOAD_S   0U
#define NVIC_SYST_RVR_RELOAD_M   0xFFFFFFU   // Counter reload value

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYST_CVR register
//
//*************************************************************************************************
#define NVIC_SYST_CVR_CURRENT_S   0U
#define NVIC_SYST_CVR_CURRENT_M   0xFFFFFFU   // Current counter value

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYST_CALIB register
//
//*************************************************************************************************
#define NVIC_SYST_CALIB_TENMS_S   0U
#define NVIC_SYST_CALIB_TENMS_M   0xFFFFFFU     // Current counter value
#define NVIC_SYST_CALIB_SKEW      0x40000000U   // Indicates whether the TENMS value is exact
#define NVIC_SYST_CALIB_NOREF     0x80000000U   // Device provides a reference clock to the
                                                // processor


//*************************************************************************************************
//
// The following are defines for the bit fields in the MPU_TYPE register
//
//*************************************************************************************************
#define NVIC_MPU_TYPE_SEPARATE    0x1U        // unified/separate instruction and date memory maps
#define NVIC_MPU_TYPE_DREGION_S   8U
#define NVIC_MPU_TYPE_DREGION_M   0xFF00U     // Indicates the number of supported MPU data regions
#define NVIC_MPU_TYPE_IREGION_S   16U
#define NVIC_MPU_TYPE_IREGION_M   0xFF0000U   // Indicates the number of supported MPU instruction
                                              // regions

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPU_CTRL register
//
//*************************************************************************************************
#define NVIC_MPU_CTRL_ENABLE       0x1U   // Enables the MPU
#define NVIC_MPU_CTRL_HFNMIENA     0x2U   // Enables MPU during hard fault, NMI, and FAULTMASK
                                          // handlers.
#define NVIC_MPU_CTRL_PRIVDEFENA   0x4U   // Enables privileged software access to the default
                                          // memory map

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPU_RNR register
//
//*************************************************************************************************
#define NVIC_MPU_RNR_REGION_S   0U
#define NVIC_MPU_RNR_REGION_M   0xFFU   // MPU region referred by the MPU_RBAR and MPU_RASR
                                        // registers.

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPU_RBAR register
//
//*************************************************************************************************
#define NVIC_MPU_RBAR_REGION_S   0U
#define NVIC_MPU_RBAR_REGION_M   0xFU          // MPU region field
#define NVIC_MPU_RBAR_VALID      0x10U         // MPU Region Number valid bit
#define NVIC_MPU_RBAR_ADDR_S     5U
#define NVIC_MPU_RBAR_ADDR_M     0xFFFFFFE0U   // Region base address field

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPU_RASR register
//
//*************************************************************************************************
#define NVIC_MPU_RASR_ENABLE   0x1U          // Region enable bit.
#define NVIC_MPU_RASR_SIZE_S   1U
#define NVIC_MPU_RASR_SIZE_M   0x3EU         // Specifies the size of the MPU protection region.
#define NVIC_MPU_RASR_SRD_S    8U
#define NVIC_MPU_RASR_SRD_M    0xFF00U       // Subregion disable bits
#define NVIC_MPU_RASR_B        0x10000U      // Memory access attribute
#define NVIC_MPU_RASR_C        0x20000U      // Memory access attribute
#define NVIC_MPU_RASR_S        0x40000U      // Memory access attribute
#define NVIC_MPU_RASR_TEX_S    19U
#define NVIC_MPU_RASR_TEX_M    0x380000U     // Memory access attribute
#define NVIC_MPU_RASR_AP_S     24U
#define NVIC_MPU_RASR_AP_M     0x7000000U    // Memory access attribute
#define NVIC_MPU_RASR_XN       0x10000000U   // Instruction access disable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPU_RBAR_A1 register
//
//*************************************************************************************************
#define NVIC_MPU_RBAR_A1_REGION_S   0U
#define NVIC_MPU_RBAR_A1_REGION_M   0xFU          // MPU region field
#define NVIC_MPU_RBAR_A1_VALID      0x10U         // MPU Region Number valid bit
#define NVIC_MPU_RBAR_A1_ADDR_S     5U
#define NVIC_MPU_RBAR_A1_ADDR_M     0xFFFFFFE0U   // Region base address field

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPU_RASR_A1 register
//
//*************************************************************************************************
#define NVIC_MPU_RASR_A1_ENABLE   0x1U          // Region enable bit.
#define NVIC_MPU_RASR_A1_SIZE_S   1U
#define NVIC_MPU_RASR_A1_SIZE_M   0x3EU         // Specifies the size of the MPU protection region.
#define NVIC_MPU_RASR_A1_SRD_S    8U
#define NVIC_MPU_RASR_A1_SRD_M    0xFF00U       // Subregion disable bits
#define NVIC_MPU_RASR_A1_B        0x10000U      // Memory access attribute
#define NVIC_MPU_RASR_A1_C        0x20000U      // Memory access attribute
#define NVIC_MPU_RASR_A1_S        0x40000U      // Memory access attribute
#define NVIC_MPU_RASR_A1_TEX_S    19U
#define NVIC_MPU_RASR_A1_TEX_M    0x380000U     // Memory access attribute
#define NVIC_MPU_RASR_A1_AP_S     24U
#define NVIC_MPU_RASR_A1_AP_M     0x7000000U    // Memory access attribute
#define NVIC_MPU_RASR_A1_XN       0x10000000U   // Instruction access disable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPU_RBAR_A2 register
//
//*************************************************************************************************
#define NVIC_MPU_RBAR_A2_REGION_S   0U
#define NVIC_MPU_RBAR_A2_REGION_M   0xFU          // MPU region field
#define NVIC_MPU_RBAR_A2_VALID      0x10U         // MPU Region Number valid bit
#define NVIC_MPU_RBAR_A2_ADDR_S     5U
#define NVIC_MPU_RBAR_A2_ADDR_M     0xFFFFFFE0U   // Region base address field

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPU_RASR_A2 register
//
//*************************************************************************************************
#define NVIC_MPU_RASR_A2_ENABLE   0x1U          // Region enable bit.
#define NVIC_MPU_RASR_A2_SIZE_S   1U
#define NVIC_MPU_RASR_A2_SIZE_M   0x3EU         // Specifies the size of the MPU protection region.
#define NVIC_MPU_RASR_A2_SRD_S    8U
#define NVIC_MPU_RASR_A2_SRD_M    0xFF00U       // Subregion disable bits
#define NVIC_MPU_RASR_A2_B        0x10000U      // Memory access attribute
#define NVIC_MPU_RASR_A2_C        0x20000U      // Memory access attribute
#define NVIC_MPU_RASR_A2_S        0x40000U      // Memory access attribute
#define NVIC_MPU_RASR_A2_TEX_S    19U
#define NVIC_MPU_RASR_A2_TEX_M    0x380000U     // Memory access attribute
#define NVIC_MPU_RASR_A2_AP_S     24U
#define NVIC_MPU_RASR_A2_AP_M     0x7000000U    // Memory access attribute
#define NVIC_MPU_RASR_A2_XN       0x10000000U   // Instruction access disable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPU_RBAR_A3 register
//
//*************************************************************************************************
#define NVIC_MPU_RBAR_A3_REGION_S   0U
#define NVIC_MPU_RBAR_A3_REGION_M   0xFU          // MPU region field
#define NVIC_MPU_RBAR_A3_VALID      0x10U         // MPU Region Number valid bit
#define NVIC_MPU_RBAR_A3_ADDR_S     5U
#define NVIC_MPU_RBAR_A3_ADDR_M     0xFFFFFFE0U   // Region base address field

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPU_RASR_A3 register
//
//*************************************************************************************************
#define NVIC_MPU_RASR_A3_ENABLE   0x1U          // Region enable bit.
#define NVIC_MPU_RASR_A3_SIZE_S   1U
#define NVIC_MPU_RASR_A3_SIZE_M   0x3EU         // Specifies the size of the MPU protection region.
#define NVIC_MPU_RASR_A3_SRD_S    8U
#define NVIC_MPU_RASR_A3_SRD_M    0xFF00U       // Subregion disable bits
#define NVIC_MPU_RASR_A3_B        0x10000U      // Memory access attribute
#define NVIC_MPU_RASR_A3_C        0x20000U      // Memory access attribute
#define NVIC_MPU_RASR_A3_S        0x40000U      // Memory access attribute
#define NVIC_MPU_RASR_A3_TEX_S    19U
#define NVIC_MPU_RASR_A3_TEX_M    0x380000U     // Memory access attribute
#define NVIC_MPU_RASR_A3_AP_S     24U
#define NVIC_MPU_RASR_A3_AP_M     0x7000000U    // Memory access attribute
#define NVIC_MPU_RASR_A3_XN       0x10000000U   // Instruction access disable bit



#endif
